In [1]:
import pandas as pd

In [2]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [3]:
# Create a Pandas Series from a list

school_series = pd.Series(high_schools)

In [4]:
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [5]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [6]:
#Initialize a new Dataframe
schools_df = pd.DataFrame()

In [7]:
schools_df["School ID"] = school_id

In [8]:
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [9]:
schools_df["School Name"] = school_name

In [10]:
schools_df

   School ID            School Name
0          0      Huang High School
1          1   Figueroa High School
2          2    Shelton High School
3          3  Hernandez High School
4          4    Griffin High School

In [11]:
schools_df['Type'] = type_of_school

In [12]:
schools_df

   School ID            School Name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [13]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [14]:
high_schools_dict

{'School ID': [0, 1, 2, 3, 4],
 'school_name': ['Huang High School',
  'Figueroa High School',
  'Shelton High School',
  'Hernandez High School',
  'Griffin High School'],
 'type': ['District', 'District', 'Charter', 'District', 'Charter']}

In [15]:
schools2_df = pd.DataFrame()

In [16]:
schools2_df["School ID"] = high_schools_dict["School ID"]

In [17]:
schools2_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [18]:
schools2_df = high_schools_dict

In [19]:
schools2_df

{'School ID': [0, 1, 2, 3, 4],
 'school_name': ['Huang High School',
  'Figueroa High School',
  'Shelton High School',
  'Hernandez High School',
  'Griffin High School'],
 'type': ['District', 'District', 'Charter', 'District', 'Charter']}

In [20]:
schools2_df['School Name'] = high_schools_dict["school_name"]

In [21]:
schools2_df

{'School ID': [0, 1, 2, 3, 4],
 'school_name': ['Huang High School',
  'Figueroa High School',
  'Shelton High School',
  'Hernandez High School',
  'Griffin High School'],
 'type': ['District', 'District', 'Charter', 'District', 'Charter'],
 'School Name': ['Huang High School',
  'Figueroa High School',
  'Shelton High School',
  'Hernandez High School',
  'Griffin High School']}

In [22]:
schools_df.columns

Index(['School ID', 'School Name', 'Type'], dtype='object')

In [23]:
schools_df.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
schools_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [25]:
# Three separate lists of information on high schools
school_id3 = [0, 1, 2, 3, 4]

school_name3 = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school3 = ["District", "District", "Charter", "District","Charter"]

In [26]:
import pandas as pd

In [27]:
school_info = pd.DataFrame()

In [28]:
school_info["School ID"] = school_id3

In [29]:
school_info

   School ID
0          0
1          1
2          2
3          3
4          4

In [30]:
school_info["school_name"] = school_name3

In [32]:
school_info

   School ID            school_name
0          0      Huang High School
1          1   Figueroa High School
2          2    Shelton High School
3          3  Hernandez High School
4          4    Griffin High School